Revit 2026 API

# UIDocumentSelection Property

---

Retrieve the currently selected Elements in Autodesk Revit.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Selection Selection { get; }
```
```vb
Public ReadOnly Property Selection As Selection
	Get
```
```cpp
public:
property Selection^ Selection {
	Selection^ get ();
}
```
```fsharp
member Selection : Selection with get
```

#### Property Value

Selection

Returns an object that represents the active selection. The Selection property returns an object that represents the active selection when the command was started.

#### Reference

UIDocument Class

Autodesk.Revit.UI Namespace